test/solver/incompressibleFluid/preprocess_case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (0   0   0)
    (1   0   0)
    (1   0.5 0)
    (0   0.5 0)
    (0   0   0.5)
    (1   0   0.5)
    (1   0.5 0.5)
    (0   0.5 0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (16 8 8) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
